package com.example.fcmexpr.miner;

import java.util.regex.Matcher;
import java.util.regex.Pattern;

/* loaded from: classes.dex */
public abstract class zZKhbgvUfsK4AEX3r0 {
    public static double[] lEeR5KfoEr4xU5yHH7(String str) throws NumberFormatException {
        Matcher matcher = null;
        double[] dArr = null;
        int i = 0;
        int i2 = 0;
        String strGroup = null;
        double d = 0.0d;
        double d2 = 0.0d;
        double d3 = 0.0d;
        int i3 = 0;
        int i4 = 0;
        String str2 = "ۧ۬ۢۦۧۨۘۛۤۛۤ۬ۗۚۧۨ۬۬ۨۘۛ۫ۙۨۧۜ۠ۥۘۚۜۙۚۦۜۦ۠ۥۘۜۗۡ۬ۧۥ۫ۙۖۨۚۥۘ";
        while (true) {
            switch ((((str2.hashCode() ^ 601) ^ 998) ^ 561) ^ (-594553608)) {
                case -1797393912:
                    dArr[1] = 0.0d;
                    str2 = "۬ۛۖۘۥۙۥۘۦۘۦۨۘۢۡۥۧۖۦ۬ۘۜ۠ۧۛۤۨ۠۟ۢ";
                    continue;
                case -1768055204:
                    dArr[0] = 0.0d;
                    str2 = "۠ۢۦۚۛۜۘۙۧۢۚ۟ۨۢۖۘۗ۠ۜۘۤۖۥۧۡ۬ۘۡۛۜۗۛۥ۠ۜۡۨ۠";
                    continue;
                case -1708141164:
                    i = 0;
                    str2 = "ۘۧۜۚۨۚۦۤۥ۟ۧۥۘۢۜۦۘۙۛۘ۫۫ۗ۠ۦ۟۬ۧۨۜۗۗۗ۠ۙۘۥۤۚۧۚ۫۬ۙ";
                    continue;
                case -1660821227:
                    String str3 = "ۡۢۦۘ۠۬ۚۢ۠ۖۘ۬ۦ۟۬ۖۧ۟ۦۘ۠ۙۛۛۚۦۛۡۢۚۖ۠ۖۚۦۘۘۦۖۙ۠ۡۘۥۘۗۗ۠ۘۘۘ۬ۨۘۧ۫۠۟ۨۛ";
                    while (true) {
                        switch (str3.hashCode() ^ 522339768) {
                            case -1453227153:
                                str2 = "۠۟ۡۘۚۗۤۨۡۗۚۥ۟ۗۡ۬ۙۥۚۧ۟ۨۘۧ۟ۥۛۧۦۚۘۡۘۘۦۥۘۨ۬۠۟ۡ۫۠ۤ۟";
                                break;
                            case -910433938:
                                str3 = "ۚۢۢۧۤۛۛ۠۫ۘ۫ۦۘۖۡۚ۫ۚۦۘۜۧ۫ۨۚ۠ۢۡۗۥۙۖۘ";
                            case 1293712058:
                                String str4 = "ۤۚۚۗۚۛۗ۫۫۟ۨۗۛۢۡۗ۫ۗۥۢۜ۬۠ۙۗ۠ۖۘۥۜۗ";
                                while (true) {
                                    switch (str4.hashCode() ^ (-1835764381)) {
                                        case -1950324968:
                                            str4 = i4 < 3 ? "ۤۚۥۛۡۗۚۘۡۥۢۥۘۦۜۡۘۜۛۡۘۡ۟ۗ۠ۡۘ۫ۗۦۘۨۥۘ" : "ۖۚۨۘۗۥۖۡ۬ۖۘۥۛۘۤۜۜ۠ۘۤ۟ۖ۟ۚۙۡۨۛۖۘۦۘۧۨۦۘ۠ۙ۬ۖۤۥ۬ۖۘ";
                                        case -1947201399:
                                            str3 = "ۤۖۦۘۛۗۖۗ۫ۢۥۚۥ۠ۗۧۙۨۤۨۤۦۤۖۘۘ۠ۗۖۘ۫ۛۜۘ۫ۦۚۤۘۥ";
                                            break;
                                        case -1611884306:
                                            str3 = "ۥۦۡۧۛۖ۬ۤۡ۬۟ۦۘۜۥ۟ۦ۟ۗۧ۟ۖۧۗۥۖۨ۫ۡۢۥۜ۬ۢۖۗۧۛۚۥۘ۬ۨۛ";
                                            break;
                                        case 70366056:
                                            str4 = "۫ۘۨۘۜۡۛۗۨ۠ۜۤۡۖ۠۠ۙۡۖۘۡۜۙۨۛۦۘۧ۠ۜۚ۫ۜۘ";
                                    }
                                }
                                break;
                            case 1455337659:
                                break;
                        }
                    }
                    break;
                case -1572865594:
                    return dArr;
                case -1073457523:
                    str2 = "۠ۘۘۘ۟۬ۙۡۛۡۤۢۦۜ۬ۘۧۡۤ۬ۢۙۚۜۥۘ۠ۖۗۖۤۘۙۖۡ۟ۘۨۘ";
                    continue;
                case -881167054:
                    str2 = "ۨۦۚۡۧۧۢۜۥۥۛۡۡۡۙ۬ۚۡۗۦۚۛ۠ۙۜۤۗۘۘۛ";
                    continue;
                case -856301016:
                    dArr[2] = 0.0d;
                    str2 = "ۡۖ۟ۖ۠ۘۘۖۢۦۦۖۨۡۘۜۘۧۖۦۘ۫۫ۖۘ۟۫ۨۘۖۜۨۘۡۙۨۘۚۖ۟ۘۨۢۨۘۙ۠ۦۡۘۗ۫ۘ۬۠ۡۘ";
                    continue;
                case -586463424:
                    d = 0.0d;
                    str2 = "ۘۚۛۜۦ۠ۙ۠ۧۙۤۘۧۡۨۗۜۜۙ۟ۤۥۧ۟ۖۚۖۘۦۗۖۡ۬ۗۖۘۥۘۙۚۛۗۙۧۗ۬ۜ۫ۙ۠۬ۜۦۘۜۙۚ";
                    continue;
                case -520939563:
                    dArr[i4] = d3;
                    str2 = "ۥۨ۟۟۠ۙۖۤۦۨۢۤۙۜۘۘ۫ۨۜۥۧۤۨۢۜۘۢۦۖۘۖ۟ۧۧۜ۟ۚۨۧۤۙۜۚۚۘ";
                    continue;
                case -293590443:
                    str2 = "ۨۢۤۘ۬ۚۜۘۘۨۜۡۙۗۗۦۚۜۘۢۧۛ۫ۡۥۘۡۜۢۢۦ۟ۡۜ۬ۚۙ۫۫ۨۘۨۡۥۘۡۙۥ۟ۘۦۘ";
                    d3 = d2;
                    continue;
                case -291150266:
                    i2 = i4 + 1;
                    str2 = "ۖ۬ۜۖۜۖۘۙ۬۬۠۟۫ۨۘۖۛۘۥۥ۠ۦۘۜ۠ۤۦۡ۬۠ۖ۟ۦۚۥۘۡۧ۟۠ۛۖۘۡۛ۠";
                    continue;
                case -181262199:
                    strGroup = matcher.group(i2);
                    str2 = "ۥۥ۫ۜۨۜۘ۫۠ۘۘۧۙۘۘۥۙۖۘۚۥۡۦ۬ۛۨۧۥۘۧۢۚۨۗ۫۫ۤۤۥۨۖۘۙۨۘۡ۠ۖ";
                    continue;
                case -109645522:
                    str2 = "۠ۘۘۘ۟۬ۙۡۛۡۤۢۦۜ۬ۘۧۡۤ۬ۢۙۚۜۥۘ۠ۖۗۖۤۘۙۖۡ۟ۘۨۘ";
                    i4 = i;
                    continue;
                case -79895210:
                    String str5 = "ۨۘۨۘۤ۫ۖۘۥۧۢۨۧۖ۟ۚۥۛۚۖ۫ۗۨۘۗۦ۫ۘۘۥۘۖۢۛۜ۬۟۬ۧۜۖ۬ۦۘ۠ۧۨ";
                    while (true) {
                        switch (str5.hashCode() ^ 934235072) {
                            case -886238902:
                                str2 = "ۚ۠۠ۙۜۘۘۙۗ۫ۗ۟ۘۘۜۘۗۛ۬ۘۢۛۨۘۡۨ۫ۥۡۙۨۨۘۘۗۦۖۘ۬ۖۗ";
                                continue;
                                continue;
                            case 152488034:
                                str2 = "۫۬ۡۘۗ۫ۜ۟ۤۡۘ۫ۥۗۢ۟ۤۨۦۦۘۦۘۥۘۛۚۨۘۤۚۤ۠ۧۡۧ۫ۨۘۨ۬ۢ";
                                continue;
                            case 1215903742:
                                String str6 = "ۛ۬ۜۘۨۙۤۤۜۘۥۛۘۘۚۤ۬۫۟ۚ۫ۙۖۚۨۡۘۜۤۖۚۥۘۗۡۦۘۛۡۜۘۙۡۥۘۖ۟ۙۘ۟ۨۘۥۡۥۘ";
                                while (true) {
                                    switch (str6.hashCode() ^ 1600252398) {
                                        case -878974055:
                                            str5 = "ۨۙۤ۬ۤۗۧۧۨۘ۫ۨ۟ۗۥ۟ۨۢۘۘۤۖۗۘۢۦۗۢۘۘۙۢۥۧۦۖۖۚۚۧۡۡۥۦۡۘۤۡۘۧۨۧۘ";
                                            break;
                                        case 189731900:
                                            str5 = "۟ۛۢۘۧۦۘۥۛۨ۟ۖۦۘۖۨۢۘۜۜۘۥۖۦۘۡۙۖۢۜۘۨۥۤ۟ۗۖ۬ۨۦۧ۫ۙۧۚۢۦۚۥ۟ۥ۟";
                                            break;
                                        case 1362243353:
                                            str6 = "ۡۥۥۘۡ۬ۡۘۦ۠ۗۚۗ۠ۜۥۢۡۘۡۚۛۡ۟ۨۘ۬۟۬ۢۚ";
                                        case 2083542315:
                                            str6 = "n/a".equals(strGroup) ? "ۢۢۥۘۡۙ۬ۢۡۢۤ۟ۚۛۡۘۤۘۨۢۦۜۖ۠۟ۙۗۘۘۛۘ" : "۟ۥۘۘ۬۠ۦۤۧۦ۬ۥۖۤۜۤۧۜۡۘۜۜۡۘۥۤۙۢۡ۠۫۠ۜ";
                                    }
                                }
                                break;
                            case 1937097686:
                                str5 = "ۜ۠ۚۦۥۨ۫ۨۥۘ۠ۜۗۧۙۦۘ۬ۤۖۗۖ۫ۛۗۜۧۥۜۘ۟ۚۦۧۢ۫ۖۖۨ۟ۦۤۗ۫ۨۖۙ۬ۥۛ۟";
                                break;
                        }
                    }
                    break;
                case 143862232:
                    str2 = "ۢ۫۟ۖۜۨۘۘۦۖۘۧۥۖۘۨ۬۫۟۠ۧ۬۬ۛۥۡۜۘۖ۫ۥۦۗۨۘۢۦ۠ۨ۟ۖۘۧ۟۠ۦۡۢ۟ۥۡ۠۫۬ۗۜۜۖ۟ۧ";
                    i3 = i2;
                    continue;
                case 253584519:
                    str2 = "ۦۡۢۖۢۦۚۢۙۛۚۡۘ۟ۛۗ۠ۚۖۙۛۘۛۨ۬۟ۢۘۘۡۜۦۖۛۢۜۧۤۖۚۦۘۧۦۨ";
                    d3 = d;
                    continue;
                case 342313068:
                    String str7 = "ۚۧۚۦۖۥۘ۬ۢۤۡۘۛۧۤۢۖۜۤۖ۫ۖۘۛ۫ۖۘۜۜۖ۟۫۟۫ۧۛۢۥۤ";
                    while (true) {
                        switch (str7.hashCode() ^ 127323362) {
                            case -683549716:
                                str7 = "ۡ۬ۘۘۗۗۡۘۤۖۥۘ۬ۘۜۘۥۚ۫ۥۙۙ۫ۧۘۘ۫۫ۥ۬ۢۦۚ۫ۥۥۘۜۘ۫۫ۨۘۙۥۚۧۜۡۘ۫ۗۦۛۜۢۨ۠۬۠۫";
                            case -506870828:
                                break;
                            case -40842139:
                                String str8 = "ۙۚ۠۠۬۠ۤۨۨۥۜۦۧۥۤۜ۠ۚۗۚۛ۬ۢۦۜۦۘۜۢ۫۫ۤۜۧۤۙ۠۠ۜ۠ۥۘۧۚۡۘۨۜ";
                                while (true) {
                                    switch (str8.hashCode() ^ 2018730258) {
                                        case -402458366:
                                            str7 = "ۙۛۗۨۢۚ۫ۤۘۘۜۧۦۙ۫ۜۘۜۨۜ۬ۘۧۘۤۗۛۨۥۚۤ۫ۚ";
                                            break;
                                        case -190269825:
                                            str8 = matcher.find() ? "ۗۙۘۘۧ۫ۡۗۦۥ۠۫ۛۗۚۖۙۜۨۗۖۘۥۚ۠ۛۦۧ۟ۘۤۖ۬۫ۨ۬ۖۘۦۨۘۖۖۤۨۡۖۘۗ۟ۦۘ" : "ۗ۬ۢۖۦۖۚۜۥۜۘ۠۫۠ۤ۟ۘۦۛ۟ۘۢۙۜ۠ۤ۬ۥۡۘۘ۠ۦۘۦۦۧ";
                                        case 1453189237:
                                            str7 = "۬ۘۡۘۘۗ۫ۖۨۜۘۤۤۦۘۧۢۛۡۜۥۘ۠ۢۖۘۘۨ۟۬۟ۨ۟ۧۦۖ۟ۘۧ۫ۧۚۨۘۘ۫ۦۚ";
                                            break;
                                        case 2107720132:
                                            str8 = "۬ۨۖۘۛۙۦۛۜۘۡ۫ۢۛۡۘۦۗ۟ۛۤۛۛۧۡۘۛۦۦۘۢۢۘ۠ۛۨۨۧ۫ۖۢۗ۟ۜۖۤۥۜۘۗۗۨۘ";
                                    }
                                }
                                break;
                            case 27733966:
                                str2 = "ۛ۟ۘۘ۫۠ۗۙ۬۟ۧۡ۟ۨ۬ۤۢۜۛۖ۠ۡۘۦۗ۠ۧۢۢۨۙۚ";
                                break;
                        }
                    }
                    break;
                case 528050526:
                    str2 = "ۚۙۧۚۖ۬۫ۧۜۧۘۗۗۢۡۛۦۡۡۦۡۙ۟ۧۜ۬ۛۧۚۤۢ۬ۗۜۥۘ";
                    i4 = i3;
                    continue;
                case 689838802:
                    d2 = Double.parseDouble(strGroup);
                    str2 = "۬۠۠۟ۗۨۚۙۗ۫۬ۨۙۡ۬ۧۗۥۡۘ۫ۤۖۘۚۜۖ۬۠ۜۘۤ۫ۘۘۡۦۡۘۨ۫۬۟۬ۘۛۗۖۘ۟ۤۙۧۥۨۘ۠ۦۚ";
                    continue;
                case 740139744:
                    dArr = new double[3];
                    str2 = "ۘۖ۠ۧۙۤ۟ۖۥۘۢۛۙۦ۟ۖ۬ۡ۬ۥ۬ۤ۫ۗۥۨۤۨ۬ۖۢۢۥۘۤۙ";
                    continue;
                case 935434043:
                    str2 = "ۨۢۤۘ۬ۚۜۘۘۨۜۡۙۗۗۦۚۜۘۢۧۛ۫ۡۥۘۡۜۢۢۦ۟ۡۜ۬ۚۙ۫۫ۨۘۨۡۥۘۡۙۥ۟ۘۦۘ";
                    continue;
                case 1014775586:
                    matcher = Pattern.compile("10s/60s/15m\\s+([\\d.]+|n/a)\\s+([\\d.]+|n/a)\\s+([\\d.]+|n/a)").matcher(str);
                    str2 = "۟ۜۢۧۙۨۗۥۘۤۘۘۘ۟ۖۦۘۙۧۡۗۚۨۚۛۛۘۚۛ۬ۛۘۘ";
                    continue;
            }
            str2 = "ۙ۟۫ۖ۫ۚۦۦۙ۫۬۫ۙۜ۫ۨ۠ۚۙۤۡ۬ۢۗۡۖۛۢۘۘ۠ۙۢ۟۫ۛۢۚ۫ۤۗۖۘ";
        }
    }
}
